DROP TABLE IF EXISTS users;

--テーブルがなっかたら作成
CREATE TABLE IF NOT EXISTS  users(
    id INTEGER,
    tetail TEXT
);

--テストデータの挿入
INSERT INTO
    customers
VALUES
    (1, '2030 年までに、現在 1 日 1.25 ドル未満で生活する人々と定義されている極度の貧困をあらゆる場所で終わらせる。2030 年までに、各国定義によるあらゆる次元の貧困状態にある、すべての年齢の男性、女性、子どもの割合を半減させる。各国において最低限の基準を含む適切な社会保護制度及び対策を実施し、2030 年までに貧困層及び脆弱層に対し十分な保護を達成する。2030 年までに、貧困層及び脆弱層をはじめ、すべての男性及び女性が、基礎的サービスへのアクセス、土地及びその他の形態の財産に対する所有権と管理権限、相続財産、天然資源、適切な新技術、マイクロファイナンスを含む金融サービスに加え、経済的資源についても平等な権利を持つことができるように確保する。2030 年までに、貧困層や脆弱な状況にある人々の強靱性（レジリエンス）を構築し、気候変動に関連する極端な気象現象やその他の経済、社会、環境的ショックや災害に暴露や脆弱性を軽減する。あらゆる次元での貧困を終わらせるための計画や政策を実施するべく、後発開発途上国をはじめとする開発途上国に対して適切かつ予測可能な手段を講じるため、開発協力の強化などを通じて、さまざまな供給源からの相当量の資源の動員を確保する。貧困撲滅のための行動への投資拡大を支援するため、国、地域及び国際レベルで、貧困層やジェンダーに配慮した開発戦略に基づいた適正な政策的枠組みを構築する。')
    (2, )